//Задайте массив из вещественных чисел с ненулевой дробной частью. Найдите разницу между максимальным и минимальным элементов массива.
//int[] array = {0.25, 5.4, 1.3, 2.1, 3.8, 5.2, 3.01}; // Создание массива


// найти максимальный элемент и минимальный
// после найти разницу?

//int[] array = {0.25, 5.4, 1.3, 2.1, 3.8, 5.2, 3.01}; // Создание массива

//int i = 0;  // записываем "счётчик", чтобы сравнение шло с первого элемента массива
//int max = array[0];  // приписываем для начала,что максимальное -первый элемент в массиве, чтобы начиналось сравнение первого и последующих

//while (i < n)
///{
    //if (array[i] > max)
    //{
    //  max = array[i];
    ////}
  
    //i = i + 1;

//}
//Console.WriteLine(max-min);

